lkolbly/cmsis-svd/data/TexasInstruments/LM3S9BN5.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB0</name>
      <description>Register map for USB0 peripheral</description>
      <groupName>USB</groupName>
      <prependToName>USB0</prependToName>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FADDR</name>
          <description>USB Device Functional Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FADDR</name>
              <description>Function Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>USB Power</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_POWER_PWRDNPHY</name>
              <description>Power Down PHY</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_POWER_SUSPEND</name>
              <description>SUSPEND Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_POWER_RESUME</name>
              <description>RESUME Signaling</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_POWER_RESET</name>
              <description>RESET Signaling</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_POWER_SOFTCONN</name>
              <description>Soft Connect/Disconnect</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_POWER_ISOUP</name>
              <description>Isochronous Update</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIS</name>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIS_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP1</name>
              <description>TX Endpoint 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP2</name>
              <description>TX Endpoint 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP3</name>
              <description>TX Endpoint 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP4</name>
              <description>TX Endpoint 4 Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP5</name>
              <description>TX Endpoint 5 Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP6</name>
              <description>TX Endpoint 6 Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP7</name>
              <description>TX Endpoint 7 Interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP8</name>
              <description>TX Endpoint 8 Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP9</name>
              <description>TX Endpoint 9 Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP10</name>
              <description>TX Endpoint 10 Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP11</name>
              <description>TX Endpoint 11 Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP12</name>
              <description>TX Endpoint 12 Interrupt</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP13</name>
              <description>TX Endpoint 13 Interrupt</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP14</name>
              <description>TX Endpoint 14 Interrupt</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP15</name>
              <description>TX Endpoint 15 Interrupt</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIS</name>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIS_EP1</name>
              <description>RX Endpoint 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP2</name>
              <description>RX Endpoint 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP3</name>
              <description>RX Endpoint 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP4</name>
              <description>RX Endpoint 4 Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP5</name>
              <description>RX Endpoint 5 Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP6</name>
              <description>RX Endpoint 6 Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP7</name>
              <description>RX Endpoint 7 Interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP8</name>
              <description>RX Endpoint 8 Interrupt</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP9</name>
              <description>RX Endpoint 9 Interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP10</name>
              <description>RX Endpoint 10 Interrupt</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP11</name>
              <description>RX Endpoint 11 Interrupt</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP12</name>
              <description>RX Endpoint 12 Interrupt</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP13</name>
              <description>RX Endpoint 13 Interrupt</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP14</name>
              <description>RX Endpoint 14 Interrupt</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP15</name>
              <description>RX Endpoint 15 Interrupt</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIE</name>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIE_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP1</name>
              <description>TX Endpoint 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP2</name>
              <description>TX Endpoint 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP3</name>
              <description>TX Endpoint 3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP4</name>
              <description>TX Endpoint 4 Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP5</name>
              <description>TX Endpoint 5 Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP6</name>
              <description>TX Endpoint 6 Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP7</name>
              <description>TX Endpoint 7 Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP8</name>
              <description>TX Endpoint 8 Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP9</name>
              <description>TX Endpoint 9 Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP10</name>
              <description>TX Endpoint 10 Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP11</name>
              <description>TX Endpoint 11 Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP12</name>
              <description>TX Endpoint 12 Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP13</name>
              <description>TX Endpoint 13 Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP14</name>
              <description>TX Endpoint 14 Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP15</name>
              <description>TX Endpoint 15 Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIE</name>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIE_EP1</name>
              <description>RX Endpoint 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP2</name>
              <description>RX Endpoint 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP3</name>
              <description>RX Endpoint 3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP4</name>
              <description>RX Endpoint 4 Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP5</name>
              <description>RX Endpoint 5 Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP6</name>
              <description>RX Endpoint 6 Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP7</name>
              <description>RX Endpoint 7 Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP8</name>
              <description>RX Endpoint 8 Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP9</name>
              <description>RX Endpoint 9 Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP10</name>
              <description>RX Endpoint 10 Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP11</name>
              <description>RX Endpoint 11 Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP12</name>
              <description>RX Endpoint 12 Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP13</name>
              <description>RX Endpoint 13 Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP14</name>
              <description>RX Endpoint 14 Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP15</name>
              <description>RX Endpoint 15 Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>USB General Interrupt Status</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IS_SUSPEND</name>
              <description>SUSPEND Signaling Detected</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_IS_RESUME</name>
              <description>RESUME Signaling Detected</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_IS_BABBLE</name>
              <description>Babble Detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_IS_SOF</name>
              <description>Start of Frame</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_IS_CONN</name>
              <description>Session Connect</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_IS_DISCON</name>
              <description>Session Disconnect</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_IS_SESREQ</name>
              <description>SESSION REQUEST</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_IS_VBUSERR</name>
              <description>VBUS Error</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>USB General Interrupt Status</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IS_RESET</name>
              <description>RESET Signaling Detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>USB Interrupt Enable</description>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IE_SUSPND</name>
              <description>Enable SUSPEND Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_IE_RESUME</name>
              <description>Enable RESUME Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_IE_BABBLE</name>
              <description>Enable Babble Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_IE_SOF</name>
              <description>Enable Start-of-Frame Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_IE_CONN</name>
              <description>Enable Connect Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_IE_DISCON</name>
              <description>Enable Disconnect Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_IE_SESREQ</name>
              <description>Enable Session Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_IE_VBUSERR</name>
              <description>Enable VBUS Error Interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>USB Interrupt Enable</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IE_RESET</name>
              <description>Enable RESET Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <description>USB Frame Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_FRAME</name>
              <description>Frame Number</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDX</name>
          <description>USB Endpoint Index</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_EPIDX_EPIDX</name>
              <description>Endpoint Index</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>USB Test Mode</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TEST_FORCEFS</name>
              <description>Force Full-Speed Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TEST_FIFOACC</name>
              <description>FIFO Access</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TEST_FORCEH</name>
              <description>Force Host Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO0_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO1_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO2_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO3_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO4</name>
          <description>USB FIFO Endpoint 4</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO4_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO5</name>
          <description>USB FIFO Endpoint 5</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO5_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO6</name>
          <description>USB FIFO Endpoint 6</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO6_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
